package com.example;

public class Application {
    public static void main(String[] args) {
        String expression = "ֵת¸קץפ ֲץח¸‏כץ, אהחה¸טף פ זה‎שץב, צנבץ ו¸ה‏‎קתשתד‏תג ‏זאטזזחקץ, זהקת¸םתדזחקהג. Úû ח¸‏טגי ז¸ץקד‏ג ב‏םס ז תû גהדטגתדחץבסדנג א¸ץךהג. \n" +
                "ַתות¸ס גדת הלתק‏שדה, לחה דת‏‎צתüדהזחס עחהרה א¸ץךץ פקבפתחזפ זבתשזחק‏תג דתזהקת¸םתדזחקץ לתבהקתלתזאהרה ‏דש‏ק‏שטטגץ. \n" +
                "װ ‏‎טל‏ב קץםט ‏זחה¸‏ף ‏ קדûז ‏‎גתדתד‏פ, חהלדתת הח¸ץ‎‏ק והזחהפדדטף ‏‎גתדל‏קהזחס לתבהקתלתזא‏ך וה¸האהק. \n" +
                "Þ חתג דת גתדתת, והזבתשהקץבץ דתטשץלץ. װ ו¸‏םתב א קנקהשט, לחה ק‏דהÿ קזתגט גהÿ ‏דחתבבתאח, ץ קה‎גהüדה, גהû ל¸ת‎גת¸דהת זח¸תגבתד‏ת אה קזתגט רץ¸גהד‏לדהגט. \n" +
                "ֳץÿח‏ ¸תםתד‏ת גדת והגהרבץ ו¸הר¸ץגגץ ‏דחט‏ח‏קדהרה ח‏וץ, זותכ‏ץבסדה זה‎שץדדץפ שבפ ‏‎טלתד‏פ הו¸תשתבתדדנך זחה¸הד לתבהקתלתזאהÿ שטם‏. \n" +
                "ֲתדפ גהüדה דץ‎קץחס החכהג ֲץח¸‏כנ, ץ תû, צת‎ ו¸תטקתב‏לתד‏פ, גץחת¸סף.";

        char[] alphabet = {'א', 'ב', 'ג', 'ד', 'ה', 'ו', '¸', 'ז', 'ח', 'ט', 'י', 'ך', 'כ', 'ל', 'ם', 'מ', 'ן',
                               'נ', 'ס', 'ע', 'ף', 'פ', 'ץ', 'צ', 'ק', 'ר', 'ש', 'ת', 'û', 'ü', '‎', '‏', 'ÿ'};

        Decoder decoder = new Decoder();
        decoder.run(alphabet, expression);
    }
}
